<?php

namespace Database\Seeders;

use App\Models\Blog;
use App\Utils\Constants;
use Illuminate\Database\Seeder;

class BlogSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $blog = Blog::insert([[
            Constants::IMAGE => "https://i1.wp.com/cdn.nohat.cc/thumb/f/720/5171770390740992.jpg?w=1200&ssl=1",
            Constants::TITLE => "سٹرس کا باغ لگانے کا طریقہ",
            Constants::DESCRIPTION => "1۔ باغ لگانے کا عام طریقہ
اگر آپ نارمل طریقہ سے باغ لگانا چاہتے ہیں تو پودے سے پودا 18 فٹ اور قطار سے قطار کا فاصلہ بھی 18 فٹ رکھیں۔ اس طرح 120 پودے فی ایکڑ لگیں گے۔جو کہ ہر لحاظ سے موزوں ھے اس طرح لگائے گئے باغ سے آپ چار سال تک فصل بھی لے سکتے ہیں اس کے بعد باغ پھل دینے لگ جاتا ھے پھر فصل کی ضرورت ہی نہیں رہتی۔
2۔ ہائی ڈینسٹی
اس میں شمال سے جنوب کی طرف 9 فٹ اور مشرق سے مغرب کی طرف 18 فٹ یعنی پودے سے پودا 9 فٹ پر اور قطار سے قطار کا فاصلہ 18 فٹ رکھتے ہیں۔ اس طرح باغ لگانے سے آپ کے 252 پودے فی ایکڑ لگیں گے اس طرح لگے ہوئے باغ میں بھی آپ تین چار سال تک فصل لگا سکتے ہیں۔
3۔الٹرا ہائ ڈینسٹی
اس میں پودے سے پودےکا فاصلہ 7 فٹ اور قطار سے قطار کا فاصلہ 11 فٹ ہوتا ھے۔ اس طرح باغ لگانے سے آپ کے571 پودے فی ایکڑ لگیں گے۔
“اس معلومات کا تبادلہ خالصتاً بھلائی کے لئے کیا جارہا ہے تاہم ادارے کا مصنف کی رائے سے متفق ہونا ضروری نہیں”۔"
        ],

            [
                Constants::IMAGE => "https://i0.wp.com/agrieducation.pk/wp-content/uploads/2020/04/Ducks-in-rice.jpg?resize=1024%2C683&ssl=1",
                Constants::TITLE => " فارم مینجمنٹ کا ایک قدرتی طریقہ",
                Constants::DESCRIPTION => "چین، جاپان، ایران اور فرانس کے کسانوں نے زیادہ پرندوں اور کم کیڑے مار ادویات کا استعمال کرتے ہوئے چاول کی کاشت کے قدیم طریقوں کی طرف لوٹنا شروع کر دیا ہے۔
کسان صبح سویرے بانس کی چھڑی کی مدد سے بطخوں کو چاول کی کھیتی کی طرف لے جاتے ہیں۔ بطخ فصلوں کو کیڑوں کے حملوں سے بچاتی ہیں اور گھاس کاٹنے کی ذمہ دار ہوتی ہیں۔ بطخوں کے جڑی بوٹیوں کو پھاڑ کر، کیڑوں کا شکار کرنے اور اپنی کھاد کو نامیاتی پودوں کی خوراک کے طور پر چھوڑ کر، چاول کے کاشتکار مصنوعی کھادوں، جڑی بوٹیوں کو مارنے والی ادویات اور کیڑے مار ادویات کی ضرورت کو ختم کر سکتے ہیں۔
یہ تکنیک - جو کہ مربوط چاول کی بطخ کاشتکاری کے طور پر جانا جاتا ہے - بالکل نئی نہیں ہے۔ سیراب شدہ دھان کے کھیتوں میں بطخوں اور چاولوں کو ایک ساتھ اُگانے کو چین میں تقریباً 600 سال پہلے دستاویز کیا گیا تھا، اور چینی کسانوں نے صدیوں تک اس پر عمل کیا جب تک کہ وہ مصنوعی نائٹروجن کھاد اور کیمیائی کیڑے مار ادویات جیسی فوری اصلاحات کے لالچ میں نہ آ گئے۔ لیکن چونکہ حالیہ برسوں میں صنعتی ٹیکنالوجیز کے استعمال سے ماحولیات کے لیے ایک بڑھتا ہوا خطرہ ہے، کچھ کسانوں نے دنیا کے بھوکوں کو کھانا کھلانے کے لیے قدیم حکمت کی طرف رجوع کیا ہے۔
تاکاو فرونو، ایک جاپانی کسان، نے ایک مرحلہ وار گائیڈ بک لکھی جس میں یہ سکھایا گیا ہے کہ جدید دور میں بطخوں کی طاقت کو اپنا کر کیمیکل پر منحصر چاول کی پیداوار سے کیسے بچنا ہے۔ پورے ایشیا میں، دسیوں ہزار چاول کے کاشتکار اس کی پیروی کرتے ہیں، اسی طرح فرانس اور ایران کے دیہاتی بھی۔ اس طرح کی مشق نے دوسرے شعبوں میں پیشہ ور افراد کو بھی متاثر کیا ہے: مثال کے طور پر، جنوبی افریقہ میں شراب بنانے والوں نے اپنے انگور کے باغوں میں گشت کرنے کے لیے 800 ہندوستانی رنر بطخوں کی فوج کی خدمات حاصل کی ہیں۔ اور چین کے چھوٹے سے جنوبی گاؤں Xiangyang میں، چند سال پہلے سے چاول کی بطخوں کی مربوط فارمنگ کی بحالی کا آغاز کیا گیا ہے۔
تاکاو فرونو نے فارم کے انتظام میں بطخوں کی رہنمائی کے لیے واضح رہنمائی کے ساتھ اب تک دو کتابیں لکھیں۔ دی ون ڈک ریوولیوشن (2012) اور دی پاور آف ڈک: انٹیگریٹڈ رائس اینڈ ڈک فارمنگ (2001)۔ کتابوں کا ایک پیش نظارہ ذیل میں دیا گیا ہے۔"
            ],
            [
                Constants::IMAGE => "https://i1.wp.com/agrieducation.pk/wp-content/uploads/2020/04/AEP-Feedspot-1.jpg?resize=1024%2C509&ssl=1",
                Constants::TITLE => " کاشتکاری بلاگ",
                Constants::DESCRIPTION => "یہ بتاتے ہوئے بے حد خوشی کی بات ہے کہ فیڈ سپاٹ نے ایگری کو منتخب کیا۔ ایجوکیشن پاکستان کا بلاگ انٹرنیٹ پر دنیا کے ٹاپ فارمنگ بلاگز میں سے ایک ہے۔ فیڈ اسپاٹ ایک ڈیٹا کیوریٹنگ پورٹل اور 2 ملین سے زیادہ قارئین اور سبسکرائبرز کے ساتھ متاثر کن ہے۔ فیڈ اسپاٹ کا جائزہ مہمانوں کو پیشگی، آب و ہوا کو اپنانے والی پائیدار قدرتی زراعت اور جنگلات کے طریقوں کے حوالے سے معیاری معلومات اور خدمات کی بنیاد پر لگایا گیا۔
اس موقع پر فیڈ سپاٹ کے بانی انوج اگروال نے ایگری کی ٹیم کو مبارکباد دی۔ تعلیم پاکستان کی بہتری کے لیے بہترین کاوش۔ اس نے کہا؛
میں ذاتی طور پر آپ کو آپ کے بلاگ ایگری کے طور پر مبارکباد دینا چاہوں گا۔ ایجوکیشن پاکستان کو ہمارے پینلسٹ نے ویب پر سرفہرست فارمنگ بلاگز میں سے ایک کے طور پر منتخب کیا ہے۔"
            ],
            [
                Constants::IMAGE => "https://i0.wp.com/agrieducation.pk/wp-content/uploads/2020/04/screenshot_20200412-195225_15867031900861039934599450223487.jpg?w=683&ssl=1",
                Constants::TITLE => "فصل کے لئے کھادوں کی منصوبہ بندی",
                Constants::DESCRIPTION => "کپاس کی فصل کے لئے ایک بہت ہی مفید مشورہ.
سرسبز نائٹروفاس اور کیلشیم امونیم نائٹریٹ (کین گوارا) کھادیں زمین کو بنائیں جاندار اور فصل اگائیں شاندار.

طریقہ استعمال مراحل میں؛

بیج لگانے کے وقت دو (2) بوریاں سرسبز نائٹروفاس ڈالیں
-21 سے 25 دن کے بعد ایک (1) بوری سرسبز نائٹروفاس ڈالیں
پھول آنے پر (20 سے 25 دن بعد) ایک (1) بوری سرسبز کیلشیم امونیم نائٹریٹ (کین گوارا) ڈالیں.
شروعاتی ٹینڈا بننے پر (20 سے 25 دن بعد) ایک (1) بوری کیلشیم امونیم نائٹریٹ (کین گوارا) ڈالیں.
ٹینڈے کی سائیز مکمل ہونے پر (20 سے 25 دن بعد) ایک (1) بوری کیلشیم امونیم نائٹریٹ (کین گوارا) ڈالیں.
کھادوں کا استعمال 90 سے 100 دن کے درمیان مکمل کرلیں.
یہ کھادیں زمین کے گرد نمکیات کو کم کر کے زمین کو نرم اور کیمیائی عمل کو بہتر بناتے ہیں، جس سے فصل میں پھولوں کا گرنا کم ہوتا ہے اور ٹینڈے نیچے سے اوپر تک لگتے ہیں.
اس کے علاوہ عام کھادوں کے مقابلے میں آپ کو ملے 10 فیصد سے بھی زیادہ پیداوار.
نائٹروفاس ph لیول 3.5 ہے (تعمل).
کیلشیم امونیم نائٹریٹ (کین گوار) ph لیول 7.0 ہے (تعمل)
مزید معلومات کے لئے مندرجہ ذیل نمبر پر رابطہ کریں.
شکریہ"
            ],
            [
                Constants::IMAGE => "https://i0.wp.com/agrieducation.pk/wp-content/uploads/2016/12/pakistani-wheat.jpg?w=640&ssl=1",
                Constants::TITLE => "زراعت کے شعبے کو عالمی منڈی میں مسابقتی بنانے کے لیے کسان دوست ماحول کو فعال کرنا بہت ضروری ہے۔",
                Constants::DESCRIPTION => "قومی اسمبلی کے سپیکر اسد قیصر نے کہا کہ پاکستان کے زرعی شعبے کو عالمی سطح پر مسابقتی بنانے کے لیے کسانوں کے لیے سازگار ماحول ناگزیر ہے۔
ایک پریس ریلیز میں کہا گیا کہ آئندہ وفاقی بجٹ زرعی شعبے کی کھوئی ہوئی رفتار کو بحال کرنے کا ایک موقع ہونا چاہیے انہوں نے یہ بات وزیر نیشنل فوڈ سیکیورٹی اینڈ ریسرچ سید فخر امام اور وزیر برائے منصوبہ بندی و خصوصی اقدامات اسد عمر سے ملاقات کے دوران کہی۔ .


سپیکر نے کہا کہ زرعی شعبے کو زیادہ سے زیادہ سرمایہ کاری کے پیکجز کی ضرورت ہے کیونکہ یہ شعبہ پاکستان کی قومی غذائی تحفظ، غربت کے خاتمے اور لوگوں کے پائیدار معاش کے لیے اہم ہے اور رہے گا۔
انہوں نے کہا کہ ارگی مصنوعات کی خصوصی کمیٹی نے کسانوں اور زرعی شعبے کے مفادات کے تحفظ کے لیے مؤثر طریقے سے زور دیا ہے، انہوں نے مزید کہا کہ اس عزم کو آئندہ بجٹ میں خاطر خواہ نتائج میں تبدیل کیا جانا چاہیے۔
سپیکر نے وزیر سے کہا کہ وہ اس بات کو یقینی بنائیں کہ موجودہ لاک ڈاؤن سے گندم کی کٹائی متاثر نہ ہو۔

انہوں نے کہا کہ قومی اسمبلی کی خصوصی کمیٹی برائے زرعی مصنوعات (SCAP) کی سفارشات کا مقصد کسانوں اور زرعی شعبے کے مفاد میں پالیسی میں بنیادی تبدیلیاں لانا ہے۔
اسد قیصر نے کہا کہ اس حقیقت کے پیش نظر کہ 18ویں ترمیم کے بعد خوراک اور زراعت بنیادی طور پر صوبائی موضوع ہے جبکہ فوڈ سیکیورٹی اور برآمدات وفاقی موضوع ہیں، صوبائی حکومتوں سے رابطہ کیا جا سکتا ہے اور پاکستان کی زرعی ترقی کو بحال کرنے کے لیے ہم آہنگی پیدا کی جا سکتی ہے۔

انہوں نے مزید کہا کہ خصوصی کمیٹی اور وزارت نیشنل فوڈ سیکیورٹی کو چاہیے کہ وہ تجاویز پر جامع غور و فکر کریں اور اس ماہ کے آخر تک کمیٹی کو ایک جامع رپورٹ پیش کریں۔
وزیر برائے نیشنل فوڈ سیکیورٹی سید فخر امام نے کہا کہ پاکستان کی زرعی معیشت کو بہتر بنانے کے لیے قومی اسمبلی کی خصوصی کمیٹی برائے زرعی مصنوعات کی حمایت انتہائی اہم ہے۔ انہوں نے یقین دلایا کہ گندم کی کٹائی میں رکاوٹ بننے والے تمام مسائل کو صوبائی حکومتوں کے ساتھ مل کر حل کیا جائے گا۔

وفاقی وزیر برائے منصوبہ بندی و خصوصی اقدامات اسد عمر نے کہا کہ سابقہ ​​حکومتوں کے غیر معقول رویہ کی وجہ سے زراعت کا شعبہ پیچھے رہ گیا ہے۔ انہوں نے کہا کہ حکومت خصوصی کمیٹی کی سفارشات کو آئندہ بجٹ کا حصہ ضرور بنائے گی۔ انہوں نے یہ بھی بتایا کہ حکومت نے زرعی شعبے میں سرمایہ کاری لانے کے لیے اقدامات کیے ہیں۔
اجلاس کے موقع پر یہ بھی فیصلہ کیا گیا کہ ایم این اے شاندانہ گلزار خان وفاقی وزیر برائے نیشنل فوڈ سیکیورٹی اینڈ ریسرچ کے طور پر تقرری کے بعد سید فخر امام کی جگہ ایس سی اے پی کی ذیلی کمیٹی کا کنوینر ہوں گی۔",
            ],
            [
                Constants::IMAGE => "https://images.squarespace-cdn.com/content/v1/593a9008e6f2e1d2faf911ad/1601412441977-FDX96091348CRNEVKVVK/GregPrice_9176_onion+starts.jpg?format=1000w",
                Constants::TITLE => "پیاز گائیڈ",
                Constants::DESCRIPTION => "جب بھی پیاز مطلوبہ سائز تک پہنچ جائے تو ان کی کٹائی کی جا سکتی ہے جو واقعی آپ کی ضروریات یا خواہشات کے لحاظ سے مختلف ہو سکتی ہے۔ میں سختی سے تجویز کرتا ہوں کہ گھریلو باغبان پیاز کی ایک یا دو اقسام کو ذخیرہ کریں اور ان کے بڑھنے کے ساتھ ہی ان کی کٹائی/پتلا کریں۔ میں اکثر اپنے پیاز کو لگاتار ایک دوسرے کے قریب لگاتا ہوں (1-2 انچ کے فاصلے پر) اور پھر ان کے بڑے ہونے پر انہیں پتلا کرنے کا منصوبہ بناتا ہوں۔ اس طرح، میرے پاس پتلی سبز پیاز یا موسم بہار کے پیاز ہیں جن کے پتلے ہونے کا پہلا دور ہوتا ہے، پھر چھوٹی پیاز ہوتی ہے، اور آخر میں میں بلبوں کے درمیان 4 - 6 انچ کا فاصلہ چھوڑ دیتا ہوں تاکہ باقی بچ جانے والے بلبوں کو ذخیرہ کرنے کے لیے اچھے بڑے بلب بنا سکیں۔

ذخیرہ کرنے والے پیاز کی کٹائی اس وقت کی جا سکتی ہے جب چوٹییں سوکھ جائیں اور گر جائیں۔ زمین سے بلب نکالیں اور کھیت میں 3 سے 5 دن تک علاج کریں یا گودام یا گرین ہاؤس میں لائیں اور دو ہفتوں تک علاج کریں۔ سردیوں کے مہینوں میں پیاز کو کھانے کے لیے ذخیرہ کرنے کے برعکس، علاج کے لیے درحقیقت 75-80 ° F کے درمیان زیادہ درجہ حرارت کی ضرورت ہوتی ہے، جو عام طور پر گرمیوں کے آخر میں کرنا آسان ہوتا ہے!"
            ],
            [
                Constants::IMAGE => "https://images.squarespace-cdn.com/content/v1/593a9008e6f2e1d2faf911ad/1630727532289-KJMLG5E45ZEVFFX5PN4M/IMG_3102.jpg?format=750w",
                Constants::TITLE => " آلو کا وقت ہے۔",
                Constants::DESCRIPTION => "باغ میں آلو لگانا
آلو کے پودے صرف اس وقت اگنا شروع کریں گے جب مٹی 45 ڈگری فارن ہائیٹ تک پہنچ جائے اور مٹی نم ہو لیکن زیادہ پانی نہ لگے۔ یہ سبزیاں ہلکی ٹھنڈ کو برداشت کر سکتی ہیں، لیکن اگر درجہ حرارت میں بڑی کمی ہو تو آپ کو کسی قسم کا تحفظ فراہم کرنا چاہیے۔ جب حقیقت میں آلو لگانے کی بات آتی ہے تو آپ کو یہ کرنا چاہئے:

خندقیں کھودیں جو تقریباً چھ سے آٹھ انچ گہری ہوں۔ قطاروں کو تقریباً تین فٹ کا فاصلہ رکھیں۔ اگر آپ کی جگہ محدود ہے اور/یا آپ صرف بچے کے آلو اگانا چاہتے ہیں، تو آپ پودوں کے درمیان فاصلہ کم کر سکتے ہیں۔

خندقوں میں، ہر 12-15 انچ پر ایک بیج آلو لگائیں۔ آنکھ کا رخ اوپر کی طرف ہونا چاہیے اور صرف خندق کو 4 انچ مٹی سے بھرنے سے شروع ہونا چاہیے۔

پودوں کو بڑھنا شروع ہونے دیں اور پھر خندق کو بھرنا جاری رکھیں اور یہاں تک کہ پودوں کے ارد گرد مٹی کو ٹیلے لگائیں جب وہ بڑھتے رہیں۔ اسے ہِلن کہا جاتا ہے اور یہ آلو کو دھوپ سے بچاتا ہے اور ساتھ ہی پودے کو سہارا دیتا ہے۔

یہ ضروری ہے کہ آپ اپنی آلو کی بیلوں کو گرم مہینوں میں اچھی طرح سے پانی پلائیں، خاص طور پر جب پودے پھول رہے ہوں اور پھول آنے کے فوراً بعد! آلو فی ہفتہ 1-2 انچ پانی کے ساتھ سب سے زیادہ کامیابی حاصل کریں گے۔ جب پتے اور تنے پیلے ہو جائیں اور مرنا شروع ہو جائیں تو پانی دینا بند کر دیں۔ اس سے آلو کو ٹھیک کرنے میں مدد ملے گی۔
آلو کی کٹائی
جب آپ فیصلہ کرتے ہیں کہ یہ آپ کے آلو کی کٹائی کے لیے تیار ہے تو آپ کو بیلچہ یا کانٹے کی ضرورت ہوگی۔ جب آپ انہیں کھودنا شروع کریں تو محتاط رہیں کہ کندوں کو کھرچنا، زخم یا کاٹنا نہیں کیونکہ آلو کو پہنچنے والے نقصان سے ذخیرہ کرنے کے دوران گلنا سڑ جائے گا اور اسے جلد از جلد استعمال کرنا چاہیے۔ اقدامات درج ذیل ہیں:

خشک دن پر انہیں اپنے پودے کے پتوں کے کنارے سے تقریباً 12 سے 18 انچ تک کھودیں۔ پہلے بیلچے کو مکمل ہٹانے کے بعد، آلو کے لیے ہٹائی گئی گندگی کو چیک کریں۔ پھر، اپنے ہاتھوں کا استعمال کرتے ہوئے، پودے کے قریب ترین سوراخ کے کنارے کو چیک کریں کہ آیا آپ کو کوئی آلو محسوس ہو سکتا ہے۔ اگر آپ کو کوئی آلو محسوس نہیں ہوتا ہے تو، پودے کے قریب کچھ انچ کھودیں اور ضرورت کے مطابق دہرائیں۔

صرف سب سے بڑے آلو کو ہٹا دیں اور چھوٹے آلو کو چھوڑ دیں تاکہ وہ بڑھتے رہیں۔

کٹے ہوئے آلو کو زیادہ دیر تک دھوپ میں نہ چھوڑیں، کیونکہ بہت زیادہ سورج کی روشنی انہیں سبز اور زہریلا بنا سکتی ہے۔"
            ],
            [
                Constants::IMAGE => "https://images.squarespace-cdn.com/content/v1/593a9008e6f2e1d2faf911ad/1563469741083-7HH0XWGZ93K3FCZX3OPW/IMG_9340.jpg?format=750w",
                Constants::TITLE => "شائستہ گوبھی ",
                Constants::DESCRIPTION => "ڈیو وکٹر PEAS فارم میں فارم ڈائریکٹر ہیں۔ جیسے ہی گوبھی کا موسم آتا ہے، وہ شائستہ گوبھی پر کچھ خیالات اور ترکیبیں بتاتا ہے۔ ڈیو مسولا میں کھیتی باڑی کے لیے کوئی اجنبی نہیں ہے، اس نے ہمارے ریور روڈ فارم، آرچرڈ گارڈنز فارم، اور اب پی اے ایس فارم میں کاشتکاری کی ہے۔ وہ ہمارے بیج بچانے کے پروگرام کی بھی رہنمائی کرتا ہے۔

اگر کوئی مجھ سے پوچھے کہ میری پسندیدہ سبزی کون سی ہے، تو میں تقریباً ہمیشہ یہی کہوں گا، ٹھیک ہے، یہ منحصر ہے۔ پسندیدہ سبزی چننا کسی پسندیدہ بچے کو چننے کے مترادف ہے۔ میں جانتا ہوں کہ یہ آپ میں سے کچھ لوگوں کو تھوڑا سا پاگل لگ سکتا ہے، لیکن ایمانداری سے، میں جو نکتہ بنانے کی کوشش کر رہا ہوں وہ یہ ہے کہ مجھے تمام سبزیاں اس انفرادیت کے لیے پسند ہیں جو وہ میز پر لاتے ہیں۔

لیکن اگر میں ایک کو چنوں تو گوبھی میری پسندیدہ سبزی کے طور پر فہرست میں سب سے اوپر ہے اور اس کی وجہ یہ ہے: یہ ایک غذائیت سے بھرپور پاور ہاؤس ہے، اس کا ذائقہ مزیدار ہے، باورچی خانے میں بہت ورسٹائل ہے (سوچئے کچی، ابلی ہوئی، بھنی ہوئی، خمیر شدہ، اور ابلی ہوئی) )، اور اس کی اسٹوریج کی زندگی بہت لمبی ہے۔ سردیوں میں آو، جب وادی میں دو فٹ برف ہو اور درجہ حرارت انجماد سے نیچے جا رہا ہو، اس زندہ دلی سے تازگی اور کرنچ لے کر دن بچانے کے لیے شائستہ گوبھی میں داخل ہوں۔ ہر لذیذ کاٹنے میں گرمیوں اور دھوپ کا مزہ چکھنا آسان ہے۔

گوبھی باورچی خانے میں کام کا گھوڑا ہو سکتا ہے، میں اکثر محسوس کرتا ہوں کہ یہ غیر تسلیم شدہ اور کم تعریف کی جاتی ہے۔ آئیے اس کا سامنا کریں، باورچی خانے میں گوبھی ڈش کے ستارے کے بجائے معاون کردار ادا کرتی نظر آتی ہے۔ تاہم، یہاں میرے دو پسندیدہ پکوان ہیں جہاں گوبھی اسٹیج کو سامنے اور بیچ میں لے جاتی ہے۔",
            ]
        ]);

    }
}
