<?php

namespace Database\Seeders;

use App\Models\Disease;
use App\Utils\Constants;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DiseaseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        /*   [
               Constants::ENG_NAME => ,
               Constants::NAME => ,
               Constants::IMAGE => ,
               Constants::CAUSE => ,
               Constants::SOLUTION => ,
           ]*/

        DB::table(Constants::TABLE_DISEASE)->insert([[
            Constants::ENG_NAME => "Powdery Mildew",
            Constants::NAME => "پاؤڈری پھپھوندی",
            Constants::IMAGE => "https://www.familyhandyman.com/wp-content/uploads/2020/04/Powdery-Mildew-GettyImages-1090508010.jpg?resize=768,768",
            Constants::CAUSE => "پاؤڈری پھپھوندی پتوں، تنوں اور پھولوں پر سفید دھول بھری تہہ چھوڑتی ہے
۔ فنگس کی وجہ سے، یہ بہت سے پودوں کو متاثر کرتا ہے،
 بشمول لیلاکس، سیب، انگور، کھیرے، مٹر، فلوکس، گل داؤدی اور گلاب۔",
            Constants::SOLUTION => "بیضوں کے پھیلاؤ کو کم کرنے کے لیے متاثرہ پتوں کو اکٹھا کریں اور تلف کریں۔ اس کے علاوہ، پودوں کو اچھی
 نکاسی اور کافی ہوا کی گردش دیں۔ رات کو اوور ہیڈ پانی سے بچیں؛ درمیانی صبح کو ترجیح دی جاتی ہے کہ شام سے پہلے پودوں کو خشک ہونے دیں۔ پاؤڈر پھپھوندی کے لیے کمرشل فنگسائڈز دستیاب ہیں
، یا آپ ایک چمچ کے محلول کے ساتھ سپرے کر سکتے ہیں۔ بیکنگ سوڈا اور ایک چوتھائی پانی جیسا کہ جارج ڈاک اور دی گرین تھمب گارڈن ہینڈ بک کے مصنفین کیٹی ابراہم نے تجویز کیا ہے۔Lilac، ایک انتہائی خوشبودار پودا، پاؤڈر پھپھوندی کا عام شکار ہے۔",
        ],
            [
                Constants::ENG_NAME => "Downy Mildew",
                Constants::NAME => "Downy Mildew",
                Constants::IMAGE => "https://www.familyhandyman.com/wp-content/uploads/2020/05/Downy-Mildew-GettyImages-517519389.jpg?resize=768,768",
                Constants::CAUSE => "ڈاؤنی پھپھوندی فنگس جیسے جانداروں کی وجہ سے ہوتی ہے اور بہت سے زیورات
 اور خوردنی اشیاء کو متاثر کرتی ہے، جیسے امپیینس، پینسی، کولمبائن،
 انگور، لیٹش اور کول فصلیں جیسے بروکولی اور گوبھی۔ اکثر گیلے موسم کے دوران ہوتا ہے، نیچے والی پھپھوندی پتوں کے اوپری حصے کی رنگت کا باعث بنتی ہے، جب کہ تہہ میں سفید یا سرمئی سڑنا پیدا ہوتا ہے۔",
                Constants::SOLUTION => "جب دستیاب ہو تو مزاحمتی کھیتی لگائیں۔ کوئی فنگسائڈز دستیاب نہیں ہیں،
لیکن ثقافتی طریقوں سے مدد مل سکتی ہے۔ اگر پھپھوندی پھیلی ہو تو متاثرہ پودوں، یا پ
ورے پودے کو ہٹا دیں اور تباہ کریں۔ پودوں کو جمع کرنے یا شام کے وقت انہیں پانی دینے سے گریز کریں، اور سال بہ سال خوردنی اشیاء کو گھمائیں۔",
            ],
            [
                Constants::ENG_NAME => "Black Spot",
                Constants::NAME => "کالا نشان",
                Constants::IMAGE => "https://www.familyhandyman.com/wp-content/uploads/2020/05/Downy-Mildew-GettyImages-517519389.jpg?resize=768,768",
                Constants::CAUSE => "بلیک سپاٹ ایک فنگل بیماری ہے جو عام طور پر گلابوں پر پائی جاتی ہے، بلکہ دوسرے پھولوں اور پھلوں پر بھی پائی جاتی ہے۔ اگرچہ یہ
 پودوں کو بالکل نہیں مارتا، لیکن یہ انہیں کمزور کرتا ہے اور انہیں دیگر مسائل کا شکار بناتا ہے۔ ٹھنڈے، نم موسم میں،
پتوں پر چھوٹے سیاہ دھبے نمودار ہوتے ہیں، جو پیلے ہونے لگتے ہیں اور آخرکار گر جاتے ہیں۔",
                Constants::SOLUTION => "پھپھوندی بیمار چھڑیوں اور پتوں میں سردیوں میں رہتی ہے، لہٰذا سردیوں سے پہلے دونوں کو ہٹا دیں۔ پود
وں کے نیچے ملچنگ کے ذریعے پودوں کو صاف اور خشک رکھیں، گلابوں کو ایسی جگہ پر رکھیں جہاں صبح کا سورج تیزی سے اوس بن جائے، اور پودوں کو گیلا کرنے کی بجائے جڑوں کو پانی دیں۔ سیاہ دھبوں کے خلاف مزاحم گلا
ب کی اقسام کے پودے لگانے پر غور کریں۔ سیاہ دھبوں کو روکنے کے لیے پودوں پر فنگسائڈ کا سپرے بھی کیا جا سکتا ہے۔",
            ],
            [
                Constants::ENG_NAME => "Mosaic Virus",
                Constants::NAME => "موزیک وائرس",
                Constants::IMAGE => "https://www.familyhandyman.com/wp-content/uploads/2020/05/Tobacco-Mosaic-Virus-GettyImages-1200783801.jpg?resize=768,768",
                Constants::CAUSE => "موزیک وائرس کی ایک بڑی تعداد ہے، لیکن باغبانوں کو دو کا سامنا کرنے کا زیادہ امکان
ہوتا ہے: ٹماٹر موزیک وائرس اور ٹوبیکو موزیک وائرس۔ سابقہ ​​ٹماٹر، کالی مرچ، آلو، سیب، ناشپاتی اور چیری کو متاثر کرتا ہے۔ مؤخر الذکر ٹماٹر، کالی مرچ، کھیرے، لیٹش، بیٹ، پیٹونیا اور یقیناً تمباکو کو متاثر کرتا ہے۔
موزیک وائرس دبدار پیلے اور سبز پتوں کا سبب بنتا ہے جو کبھی کبھی گھماؤ اور مسخ ہو جاتے ہیں۔ کچھ پودے زرد پڑنے، نشوونما میں کمی، خراب شکل والے پھل اور کم پیداوار کی نمائش کرتے ہیں۔ گرم موسم میں موزیک وائرس زیادہ عام ہوتا ہے۔",
                Constants::SOLUTION => "کوئی کیمیائی کنٹرول نہیں ہے، لیکن مزاحم قسمیں موجود ہیں. یہ وائرس خشک مٹی م
یں کچھ عرصے تک زندہ رہ سکتا ہے۔ متاثرہ پودوں، جڑوں اور سبھی کو
ہٹا دیں اور تلف کریں، اور دو سال تک اسی علاقے میں حساس پودے لگانے سے گریز کریں۔ چونکہ تمباکو ایک کیریئر ہے، تمباکو نوشی کرنے والوں کو پودوں کو سنبھالنے سے پہلے اچھی طرح سے ہاتھ دھونے چاہئیں۔",
            ],
            [
                Constants::ENG_NAME => "Damping-Off Disease",
                Constants::NAME => "ڈیمپنگ آف بیماری",
                Constants::IMAGE => "https://www.familyhandyman.com/wp-content/uploads/2020/05/Damping-Off-Disease-GettyImages-170029053.jpg?resize=768,768",
                Constants::CAUSE => "ڈیمپنگ آف بیماری، جو مٹی سے پیدا ہونے والی متعدد فنگس کی وجہ سے ہوتی ہے
، گیلے، مرطوب حالات میں سب سے زیادہ پریشانی کا باعث ہوتی
ہے۔ یہ پودوں کو متاثر کرتا ہے اور ان کے گرنے اور سڑنے کا سبب بنتا ہے۔ یہ اکثر گرین ہاؤسز میں پایا جاتا ہے، لیکن باہر بھی ہو سکتا ہے۔",
                Constants::SOLUTION => "کوئی علاج نہیں ہے، لیکن آپ اسے اچھے ثقافتی طریقوں سے روک سکتے ہیں۔ نئے برتن، سیل پیک یا ٹرے،
یا 10 فیصد بلیچ کے محلول سے جراثیم کش استعمال کریں۔ تازہ، تھیلے والے، مٹی کے بغیر برتنوں کے مکس سے بھریں، ہجوم والے پودوں سے بچیں اور مناسب ہوا کی فراہمی کریں۔
ڈیمپنگ آف بیماری عام طور پر نئے بوئے ہوئے پودوں کو متاثر کرتی ہے۔ بیج گھر کے اندر شروع کرنے کے کامیاب نکات جانیں۔",
            ],
            [
                Constants::ENG_NAME => "Fusarium Wilt",
                Constants::NAME => "Fusarium ولٹ",
                Constants::IMAGE => "https://www.familyhandyman.com/wp-content/uploads/2020/05/Fusarium-Wilt-GettyImages-1221194369.jpg?resize=768,768",
                Constants::CAUSE => "مٹی سے پیدا ہونے والی فنگس کی وجہ سے، فوسیریم مرجھانے والے سجاوٹی اور خوردنی پودوں کو متاثر کرتا ہے، بشمول ڈیانتھس، پھلیاں، ٹماٹر، م
ٹر اور اسپرگس۔ یہ بیماری مرجھائے ہوئے پتے اور رکے ہوئے پودوں کے ساتھ ساتھ جڑوں کے سڑنے اور بعض اوقات سیاہ تنے کے سڑنے
 کا سبب بنتی ہے۔ یہ خاص طور پر گرم موسم گرما کے درجہ حرارت میں فعال ہے.",
                Constants::SOLUTION => "گھریلو باغبانوں کے لیے کوئی کیمیائی کنٹرول دستیاب نہیں ہے، لیکن بیماری کے
خلاف مزاحمت کرنے والی کاشتیں موجود ہیں۔ اگر باغ میں کسی جگہ فوزیریم مرجھا جائے
 تو متاثرہ پودوں کو ہٹا دیں اور تلف کر دیں اور پانچ سال تک اس جگہ پر ایک ہی نسل نہ لگائیں۔",
            ],
            [
                Constants::ENG_NAME => "Verticillium Wilt",
                Constants::NAME => "Verticillium Wilt",
                Constants::IMAGE => "https://www.familyhandyman.com/wp-content/uploads/2020/05/Verticillium-fungi-GettyImages-1042492416-1.jpg?resize=768,768",
                Constants::CAUSE => "ورٹیسیلیم وِلٹ ایک فنگل بیماری ہے جو درختوں، جھاڑیوں، کھانے کی اشیاء اور سجاوٹی اشیاء کی سینکڑوں انواع کو متاثر کرتی ہے (حساس پودوں کی فہرست یہاں دیکھیں)۔ پیتھوجینز
، جو مٹی میں برسوں تک رہ سکتے ہیں، جڑوں کے ذریعے پودے میں اپنا راستہ بناتے ہیں، آخر کار عروقی نظام کو روکتے ہیں اور شاخیں اچانک مرجھا جاتے ہیں ا
ور پودوں کا رنگ زرد ہو جاتا ہے اور وقت سے پہلے گر جاتے ہیں۔ یہ رکی ہوئی ترقی کا باعث بھی بن سکتا ہے۔",
                Constants::SOLUTION => "فنگسائڈز مؤثر نہیں ہیں، لیکن اچھی صفائی کے طریقوں سے مدد مل سکتی ہے. متاثرہ سالانہ، بارہماسی اور کھانے ک
ی اشیاء کو ہٹا دیں اور تلف کریں۔ بیمار شاخوں کو درختوں اور جھاڑیو
ں سے کاٹ دیں۔ (جب آپ ایسا کرتے ہیں، تو آپ کو لکڑی میں سبز رنگ کی لکیر یا داغ نظر آئے گا۔) کٹوں کے درمیان 10 فیصد بلیچ کے محلول کے ساتھ جراثیم کش کاٹنے والے اوزار۔",
            ],
            [
                Constants::ENG_NAME => "Sooty Mold",
                Constants::NAME => "سوٹی مولڈ",
                Constants::IMAGE => "https://www.familyhandyman.com/wp-content/uploads/2020/05/Sooty-Mold-GettyImages-1147925067.jpg?resize=768,768",
                Constants::CAUSE => "سوٹی مولڈ سے مراد وہ پھپھوندی ہے جو چپچپا ذخائر پر اگتی ہے، جسے ہنی ڈیو کہتے ہیں، پودوں کو چ
وسنے والے کیڑوں کے ذریعے چھوڑ دیا جاتا ہے۔ پتوں پر یہ نہ صرف بدص
ورت ہے؛ یہ فتوسنتھیسز کو روکتا ہے اور پودوں کی نشوونما کو روکتا ہے۔ سوٹی مولڈ کے ساتھ لیپت پتے بھی وقت سے پہلے گر جاتے ہیں۔",
                Constants::SOLUTION => "سوٹی مولڈ سے نمٹنے کے لیے، آپ کو پودوں کو چوسنے والے کیڑوں سے نمٹنا پڑتا ہے جو شہد کے اخراج کو چھوڑت
ے ہیں، جیسے افڈس، لیف ہاپرز اور میلی بگ۔ ان پر کیڑے مار صابن یا نیم کے تیل سے چھڑکیں۔ چیونٹیاں کھانے کے لیے شہد کی خوشبو کی طرف راغب ہوتی ہیں، اس لیے وہ پودے کو چوسنے والے کیڑوں کو شکاری کیڑوں سے بچاتی ہیں جو بصورت
دیگر کیڑوں کی آبادی پر ڈھکن رکھتے ہیں۔ چیونٹیوں کو پھنسائیں یا لکڑی والے پودوں کے ساتھ ایک چپچپا مرکب پینٹ کریں جیسے تنوں کے گرد ٹینگل فٹ۔",
            ],
            [
                Constants::ENG_NAME => "Snow Mold",
                Constants::NAME => "برف کا سانچہ",
                Constants::IMAGE => "https://www.familyhandyman.com/wp-content/uploads/2020/05/Snow-Mold-GettyImages-467729840.jpg?resize=768,768",
                Constants::CAUSE => "سنو مولڈ ایک فنگس ہے جو برف کے نیچے پائے جانے والے ٹھنڈے، نم ح
الات میں پنپتی ہے۔ یہ ٹرف گھاس پر حملہ کرتا ہے۔ برف پگھلنے کے بع
د، علامات ظاہر ہو جاتی ہیں: دھندلی گھاس کے ہلکے ٹین والے حصے جو سڑنا کے دھاگوں کی وجہ سے ہوتے ہیں۔",
                Constants::SOLUTION => "مولڈ کو توڑنے اور نئی نشوونما کے لیے دھندلی گھاس کو پکائیں۔ موسم خزاں میں، لمب
ے گھاس کے بلیڈ کو گرنے اور چٹا
ئی میں حصہ ڈالنے کی حوصلہ شکنی کرنے کے لیے سال کی آخری کٹنگ کو چھوٹا کریں۔",
            ],
            [
                Constants::ENG_NAME => "Rust",
                Constants::NAME => "زنگ",
                Constants::IMAGE => "https://www.familyhandyman.com/wp-content/uploads/2020/05/Rust-GettyImages-694659917.jpg?resize=768,768",
                Constants::CAUSE => "زنگ، ایک اور کوکیی بیماری، کو آسانی سے نظر آتا ہے کیونکہ یہ پتوں اور بعض اوقات تنو
ں پر زنگ آلود دھبے بناتا ہے۔ دھبے بالآخر سرخی مائل نارنجی سے سیا
ہ ہو جاتے ہیں۔ زنگ کی بہت سی قسمیں ہیں جو پودوں پر حملہ کر سکتی ہیں جیسے ہولی ہاکس، گلاب، ڈے لیلی اور ٹماٹر۔",
                Constants::SOLUTION => "فنگسائڈس دستیاب ہیں۔ ثقافتی طور پر، کسی بھی
 متاثرہ پودے کو اکٹھا کرنا اور تباہ
کرنا ایک اچھا عمل ہے تاکہ فنگس کو زیادہ سردیوں سے بچایا جا سکے۔",
            ],
            [
                Constants::ENG_NAME => "Late Blight",
                Constants::NAME => "لیٹ بلائٹ",
                Constants::IMAGE => "https://www.planetnatural.com/wp-content/uploads/2012/12/late-blight-tomato.jpg",
                Constants::CAUSE => "ٹماٹر اور آلو کے پودوں پر پائے جانے والے، دیر سے جھلس
والی فنگس Phytophthora infestans کی وجہ سے ہوتی ہے اور یہ پورے امریکہ میں عام ہے۔ اس کے نام کے مطابق، ی
ہ بیماری بعد میں بڑھتے ہوئے موسم میں ہوتی ہے جس کی علامات اکثر کھلنے کے بعد تک ظاہر نہیں ہوتی ہیں۔دیر سے جھلساؤ سب سے پہلے نچلے، پرانے پتوں پر پانی می
ں بھیگے ہوئے، سرمئی سبز دھبوں کے طور پر ظاہر ہوتا ہے۔ جیسے جیسے بیماری پختہ ہوتی ہے، یہ دھبے سیاہ ہو جاتے ہیں اور نیچے کی طرف سفید فنگل کی نشوونما ہوتی ہے۔ آخر کار پورا پودا متاثر ہو جائے گا۔ فصلوں کو شدید نقصان پہنچ سکتا ہے۔",
                Constants::SOLUTION => "جب دستیاب ہو تو مزاحمتی کھیتی لگائیں۔
پودے لگانے سے پہلے باغ سے رضاکاروں کو ہٹا دیں اور جگہ جگہ پودوں کو کافی فاصلے پر رکھیں تاکہ ہوا کی کافی مقدار میں گردش ہو سکے۔
صبح کے اوقات میں پانی دیں، یا سوکر ہوزز کا استعمال کریں، تاکہ پودوں کو دن کے وقت خشک ہونے کا وقت دیا جا سکے۔
کٹائی کے بعد ٹماٹر اور آلو کے تمام ملبے کو تلف کر دیں (دیکھیں فال گارڈن کلین اپ)۔",
            ],
            [
                Constants::ENG_NAME => "Leaf Crul",
                Constants::NAME => "پتی کی کرل",
                Constants::IMAGE => "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Taphrina_deformans_1.jpg/220px-Taphrina_deformans_1.jpg",
                Constants::CAUSE => "فنگس T. deformans بگڑے ہوئے نوجوان پتوں، سرخ
چھالوں اور بالآخر سفیدی مائل پھولوں کا سبب بنتی ہے جو انفیکشن کے بڑھنے کے ساتھ ہی پتے کو ڈھانپ لیتی ہے۔ یہ سفید رنگ asci سے بنا ہے جو پتے کے کٹیکل کو توڑتا ہے۔ ایک ascus آٹھ ascospores پر مشتمل ہوتا ہے جو conidia بناتے ہیں، جو گرمیوں ک
ے شروع میں نکالے جاتے ہیں اور بارش اور ہوا سے پھیل جاتے ہیں۔
فنگس موسم سرما میں میزبان پودے کی سطح پر زندہ رہتی ہے، جیسے کہ چھال یا کلیوں پر۔[2] موسم سرما کے آخر میں یا موسم بہار کے شروع میں، بارش کا پانی بیجوں کو کلیوں میں دھو دیتا ہے جیسے ہی وہ پھٹ جاتے ہیں۔ ایک بار جب ایسا ہوتا ہے، کوئی علاج مؤثر نہیں ہے. موسم بہار میں، کھلنے کے تقریباً دو ہفتے بعد، متاثرہ کلیوں سے نکلنے والے نئے پتے کونیڈیا سے متاثر ہوتے ہیں۔ درجہ حرارت اور بارش میں فرق کی وجہ سے یہ بیماری ہر سال نہیں ہو سکتی۔ خاص طور پر، کامیاب انفیکشن کے لیے، فنگس کو گیلی سردیوں کی ضرورت ہوتی ہے، جہاں بارش (دھند یا اوس نہیں) 16 °C (61 °F) سے کم درجہ حرارت پر درخت کو 12.5 گھنٹے سے زیادہ گیلا کرتی ہے۔[7] فنگس 9 °C (48 °F) سے کم درجہ حرارت پر نہیں بڑھ سکتی۔[8]",
                Constants::SOLUTION => "سب سے مؤثر طریقہ [9] یہ ہے کہ آڑو کے درختوں کو گھر کی دیوار کے ساتھ اوور لٹکی
 ہوئی چھت کے نیچے لگانا، ممکنہ طور پر سردیوں کے دوران چٹائی سے ڈھانپ دیا جاتا ہے، تاکہ موسم س
رما کی بارش کو کلیوں سے پھٹنے سے پہلے روکا جا سکے (اور اتفاق سے موسم بہار کی ٹھنڈ تک پھول آنے میں تاخیر ہو جائے۔ سے زیادہ)، جب تک کہ موسم بہار میں درجہ حرارت 16 °C (61 °F) سے زیادہ
 نہ ہو جائے، فنگس کو غیر فعال کر دیتا ہے۔
تجارتی طور پر، پتوں پر پھپھوند کش ادویات کا چھڑکاؤ سب سے عام کنٹرول طریقہ ہے۔ ان فنگسائڈز کے زہریلے ہونے کا مطلب ہے کہ یہ کچھ ممالک میں غیر تجارتی کاشتکاروں کے لیے قانونی طور پر دستیاب نہیں ہیں۔ سردیوں میں اگنے سے پہلے اچھی طرح چھڑکاؤ کیا جائے۔ اگر درختوں پر جلد اسپرے نہ کیا جائے تو علاج بے اثر ہے۔ تانبے پر مبنی مرکب (جیسے بورڈو مکسچر) اور لائم سلفر دو فنگسائڈز ہیں جو عام طور پر استعمال ہوتے ہیں۔[2][10]
آڑو کی ایسی فصلیں لگائی جا سکتی ہیں جو آڑو کے پتوں کے کرل کے خلاف کچھ مزاحمت ظاہر کرتی ہیں، یا کم از کم تیزی سے دوبارہ پیدا ہوتی ہیں، جیسے سفید گوشت والا آڑو 'بینیڈکٹ'۔[11] نیکٹیرینز کے لیے، کھیتی کریبچ میں کچھ مزاحمت کی اطلاع ہے۔",
            ],
            [
                Constants::ENG_NAME => "Leaf spot
",
                Constants::NAME => "پتے کی جگہ",
                Constants::IMAGE => "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/%27Cercospora_capsici.jpg/220px-%27Cercospora_capsici.jpg",
                Constants::CAUSE => "پتوں کے دھبوں کی وجوہات بنیادی طور پر فنگس، بیکٹیریا اور وائرس سے ہوتی ہیں۔ تاہم پتوں کے دھبے ابیوٹک عوامل جیسے ماحول
یاتی حالات، زہریلے اور جڑی بوٹی مار زخموں کی وجہ سے بھی ہو سکتے ہیں۔ فو
لیئر نیماٹوڈس پتوں کے دھبوں کی ایک اور وجہ ہے جہاں کھانا کھلانے کے دوران سیل کی دیواروں میں ڈالا جانے والا لعاب دھبوں کے نتیجے میں متاثرہ خلیوں کا رنگ بدل جاتا ہے اور زخم بن جاتے ہیں۔[6] Aphelenchoides عام فولیئر نیماٹوڈس ہیں جو پتوں کے کونیی دھبے پیدا کرتے ہیں۔ دی",
                Constants::SOLUTION => "پتوں کے داغ کی بیماری کی سب سے بڑی علامت پودوں پر دھبے ہیں۔ متاثرہ پود
ے، اس میں شامل مخصوص جاندار، اور نشوونما کے مرحلے کے لحاظ سے دھبے سائز اور رنگ میں مختلف ہوں گے۔ دھبے اکثر بھورے وتے ہیں، لیکن یہ ٹین یا کالے ہو سکتے ہیں۔ مرتکز حلقے یا سیاہ حاشیہ اکثر موجود ہوتے ہیں۔ فن
گل جسم دھبوں میں سیاہ نقطوں کے طور پر ظاہر ہو سکتے ہیں، یا تو انگوٹھیوں میں یا مرکزی جھرمٹ میں۔ وقت گزرنے کے ساتھ، دھبے اکٹھے ہو سکتے ہیں یا بڑے ہو کر دھبے بن سکتے ہیں۔ دھبے یا دھبے جو کونیی ہوتے ہیں انہیں عام طور پر اینتھراکنوز کہا جاتا ہے (درختوں کے اینتھراکنوز پر اندراج دیکھیں) پتے وقت سے پہلے پیلے اور گر سکتے ہیں۔",
            ],
            [
                Constants::ENG_NAME => "Stunting
",
                Constants::NAME => "سٹنٹنگ",
                Constants::IMAGE => "http://ephytia.inra.fr/en/Images/viewThumb/17972",
                Constants::CAUSE => "کیمیائی یا مکینیکل چوٹیں، کیڑے مکوڑے یا مائٹ کو کھانا کھل
انا، اور بہت گہرے پودے لگانا۔ انفیکشن کی وجہ سے ہونے والا
سٹنٹ اکثر دریافت ہونے پر علاج کے لیے بہت آگے بڑھ جاتا ہے۔ ایک ابیوٹک سٹنٹ، تاہم، عام طور پر علاج کیا جا سکتا ہے.",
                Constants::SOLUTION => "سٹنٹ، زراعت میں، پودوں کی بیماری کی عام علامت، جس کے نتیجے میں سائز میں کمی ا
ور طاقت کا نقصان ہوتا ہے۔ سٹنٹنگ وائرل، بیکٹیریل، فنگل، یا نیماٹوڈ (eelworm) کے انف
یکشن کی وجہ سے ہو سکتا ہے اور غیر متعدی (abiotic) ذرائع بشمول پانی کی زیادتی یا کمی، مٹی کے غذائی اجزاء کا عدم توازن، زیادہ روشنی،",
            ],
            [
                Constants::ENG_NAME => "porosis",
                Constants::NAME => "porosis",
                Constants::IMAGE => "https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww2.ipm.ucanr.edu%2Fagriculture%2Fcitrus%2FPsorosis%2F&psig=AOvVaw0Djsw5LxtsHJh5mRD3V-Ae&ust=1636147192953000&source=images&cd=vfe&ved=0CAsQjRxqFwoTCKim37fR__MCFQAAAAAdAAAAABAD",
                Constants::CAUSE => "Psorosis ایک گرافٹ سے منتقل ہونے والی بیماری ہے، جو وائرس کی وجہ سے ہوتی ہے، جو اکثر لیموں کے پرانے پودوں میں پائی جاتی ہے۔ یہ متاثرہ بڈ ووڈ میں یا ممکنہ طور پر آلودہ گرافٹنگ ٹولز سے پھیلتا ہے۔ کبھی کبھار، بیماری جڑوں کی پیوند کاری سے متاثرہ سے صحت مند درخت تک پھیلتی ہے۔ کچھ citrange cultivars کے بیج اس بیماری کے معروف کیریئر ہیں۔",
                Constants::SOLUTION => "متاثرہ درخت، زیادہ تر نارنجی اور چکوترا، آہستہ آہستہ گرتے ہیں۔ مرکزی سہاروں کی شاخیں مر جاتی ہیں اور درخت غیر پیداواری ہو جاتے ہیں۔ سب سے نمایاں فیلڈ کی علامت سکن پر چھال کا پیمانہ اور پھٹنا ہے۔ علامات، بشمول جوان پتوں پر پیلے رنگ کے جھرنا، خزاں میں ظاہر ہو سکتے ہیں۔ ابتدائی مراحل کے دوران، تنے یا سہاروں کی شاخوں پر چھال کے دھبے چھوٹے دھبے یا بلبلے دکھاتے ہیں، جو بعد میں بڑے ہو کر ڈھیلے ترازو میں ٹوٹ جاتے ہیں۔ مسوڑھوں کا ہونا اکثر زخم کے حاشیے کے گرد ظاہر ہوتا ہے۔ ترقی یافتہ مراحل میں، چھال اور لکڑی کی گہری تہیں مسوڑھوں سے رنگین ہو کر مر جاتی ہیں۔",
            ],
            [
                Constants::ENG_NAME => "Verticilium Wilt
",
                Constants::NAME => "ورٹیسیلیم ولٹ",
                Constants::IMAGE => "https://www.thespruce.com/verticillium-wilt-fungus-4845966",
                Constants::CAUSE => "ورٹیسیلیم وِلٹ کی عمومی علامات میں مرجھانا، کلوروسس (پتے کا پیلا ہونا)، اینتھوسیانیسینس (پتے یا تنے کا سرخ سے جامنی رنگ کا رنگنا)، رکا ہوا اور/یا بگڑا ہوا نشوونما، نیکروسس، اور پودے کا قبل از وقت ہو جانا شامل ہو سکتے ہیں۔",
                Constants::SOLUTION => "ورٹیسیلیم مرجھانے کے بعد پودے میں داخل ہونے کے بعد اسے ٹھیک نہیں کیا جا سکتا۔ چھوٹے، آسانی سے تبدیل کیے جانے والے پودوں کو ہٹانا اور تباہ کرنا بہتر ہے۔ آپ کے پودے کو ہٹانے کے بعد یہ بیماری مٹی میں رہتی ہے، اس لیے اسی علاقے میں کوئی اور حساس انواع نہ لگائیں۔",
            ],
            [
                Constants::ENG_NAME => "Fungal
",
                Constants::NAME => "فنگل",
                Constants::IMAGE => "https://plantvillage-production-new.s3.amazonaws.com/images/pics/000/000/812/original/Black_spot_2.jpg?1370874386",
                Constants::CAUSE => "پتوں پر چھوٹے سیاہ دھبے جو بھورے سے بھوری ہو جاتے ہیں۔ زخم گول یا کونیی ہو سکتے ہیں اور ان میں ارغوانی-سیاہ حاشیہ ہو سکتا ہے۔ گھاووں میں مرتکز حلقے بن سکتے ہیں، ٹوٹنے والے بن سکتے ہیں اور بیچ میں شگاف پڑ سکتے ہیں۔ گہرے بھورے لمبے گھاو تنے اور پیٹیول پر پیدا ہو سکتے ہیں۔",
                Constants::SOLUTION => "بیماری کا کنٹرول حفظان صحت کے طریقوں پر منحصر ہے۔ پودے لگانے سے پہلے بیجوں کو گرم پانی سے ٹریٹ کریں؛ فصلوں کو گھمائیں؛ اچھی مٹی کی نکاسی والے علاقے میں پودے لگائیں؛ تمام مصلوب گھاس کو ہٹا دیں جو فنگس کے ذخائر کے طور پر کام کر سکتے ہیں۔",
            ],
            [
                Constants::ENG_NAME => "Clubroot
",
                Constants::NAME => "کلبروٹ",
                Constants::IMAGE => "https://plantvillage-production-new.s3.amazonaws.com/images/pics/000/000/809/original/Club_root.jpg?1370873671",
                Constants::CAUSE => "آہستہ بڑھنے والے، رکے ہوئے پودے؛ پیلے رنگ کے پتے جو دن کے وقت مرجھا جاتے ہیں اور رات کو کچھ حد تک جوان ہو جاتے ہیں۔ سوجن، مسخ شدہ جڑیں؛ وسیع پتے کی تشکیل",
                Constants::SOLUTION => "ایک بار جب پیتھوجین مٹی میں موجود ہو جائے تو یہ کئی سالوں تک زندہ رہ سکتا ہے، روگزن کا خاتمہ اقتصادی طور پر ناقابل عمل ہے۔ گھومنے والی فصلیں عام طور پر موثر کنٹرول فراہم نہیں کرتی ہیں۔ صرف تصدیق شدہ بیج لگائیں اور کھیت میں اگائے جانے والے ٹرانسپلانٹس سے پرہیز کریں جب تک کہ دھونے والے بستر میں پیدا نہ کیا جائے۔ مٹی میں چونا لگانے سے فنگس اسپورولیشن کو کم کیا جا سکتا ہے۔",
            ],
            [
                Constants::ENG_NAME => "Downy mildew",
                Constants::NAME => "Downy mildew",
                Constants::IMAGE => "https://plantvillage-production-new.s3.amazonaws.com/images/pics/000/000/810/original/Downy_mildew_1.jpg?1370874035",
                Constants::CAUSE => "ٹھنڈے، مرطوب موسم کو پسند کرتا ہے؛ گوبھی کے سر کو نقصان اس وقت تک نظر نہیں آتا جب تک گوبھی کو کھلا نہ کاٹا جائے۔",
                Constants::SOLUTION => "کٹائی کے بعد فصل کا تمام ملبہ ہٹا دیں۔ غیر براسیکاس کے ساتھ گھمائیں؛ اگر بیماری کی علامات موجود ہوں تو مناسب فنگسائڈز کے استعمال کی ضرورت پڑسکتی ہے۔",
            ],
            [
                Constants::ENG_NAME => "Cabbage aphid
",
                Constants::NAME => "گوبھی افیڈ",
                Constants::IMAGE => "https://plantvillage-production-new.s3.amazonaws.com/images/pics/000/001/356/original/Cabbage_aphid_1.jpg?1378393597",
                Constants::CAUSE => "بڑی آبادی رکی ہوئی نشوونما یا پودوں کی موت کا سبب بن سکتی ہے۔ کیڑے پودے کے پتوں پر نظر آسکتے ہیں اور چھوٹے، سرمئی سبز رنگ کے اور نرم جسم والے ہوتے ہیں اور سفید مومی کوٹنگ سے ڈھکے ہوتے ہیں۔ گوبھی کے سر میں گہرائی سے کھانا کھلانا پسند کرتے ہیں اور پتیوں سے دھندلا ہو سکتا ہے۔",
                Constants::SOLUTION => "ایف ایفڈ کی آبادی صرف چند پتوں یا ٹہنیوں تک محدود ہوتی ہے پھر اس بیماری کو کنٹرول کرنے کے لیے کاٹ کر ختم کیا جا سکتا ہے۔ پودے لگانے سے پہلے aphids کے لئے ٹرانسپلانٹ چیک کریں؛ اگر دستیاب ہو تو برداشت کرنے والی اقسام کا استعمال کریں۔ عکاس ملچس جیسے چاندی کے رنگ کا پلاسٹک aphids کو پودوں پر کھانا کھلانے سے روک سکتا ہے۔ پتوں سے افڈس کو دستک کرنے کے لئے مضبوط پودوں کو پانی کے ایک مضبوط جیٹ سے چھڑکایا جا سکتا ہے۔ کیڑے مار ادویات کی عام طور پر صرف افڈس کے علاج کے لیے ضرورت ہوتی ہے اگر انفیکشن بہت زیادہ ہو - پودے عام طور پر کم اور درمیانے درجے کے انفیکشن کو برداشت کرتے ہیں۔ کیڑے مار صابن یا تیل جیسے نیم یا کینولا کا تیل عام طور پر کنٹرول کا بہترین طریقہ ہے۔ استعمال سے پہلے مخصوص استعمال کے رہنما خطوط کے لیے ہمیشہ مصنوعات کے لیبل چیک کریں۔",
            ],
            [
                Constants::ENG_NAME => "Beet armyworm",
                Constants::NAME => "بیٹ آرمی ورم",
                Constants::IMAGE => "https://plantvillage-production-new.s3.amazonaws.com/images/pics/000/001/350/original/Beet_armyworm_3.jpg?1378393091",
                Constants::CAUSE => "واحد، یا قریب سے گروپ شدہ سرکلر سے لے کر پودوں میں بے قاعدہ شکل کے سوراخ؛ نوجوان لاروا کی طرف سے بہت زیادہ کھانا کھلانے سے پتوں کا کنکال بن جاتا ہے۔ پھلوں پر اتھلے، خشک زخم؛ 50-150 انڈوں کے جھرمٹ پتوں پر موجود ہو سکتے ہیں۔ انڈے کے جھرمٹ سفید رنگ کے پیمانے پر ڈھانپے جاتے ہیں جو کہ جھرمٹ کو کاٹنی یا مبہم شکل دیتا ہے۔ نوجوان لاروا ہلکے سبز سے پیلے رنگ کے ہوتے ہیں جبکہ پرانے لاروا عام طور پر گہرے سبز ہوتے ہیں جن کے جسم کے ساتھ ساتھ ایک سیاہ اور ہلکی لکیر چلتی ہے اور نیچے گلابی یا پیلا ہوتا ہے۔",
                Constants::SOLUTION => "چقندر کے آرمی ورم کو کنٹرول کرنے کے نامیاتی طریقوں میں قدرتی دشمنوں کا حیاتیاتی کنٹرول شامل ہے جو لاروا کو طفیلی بنا دیتا ہے اور Bacillus thuringiensis کا استعمال؛ تجارتی کنٹرول کے لیے کیمیکل دستیاب ہیں لیکن بہت سے جو گھریلو باغ کے لیے دستیاب ہیں وہ لاروا کو مناسب کنٹرول فراہم نہیں کرتے ہیں۔",
            ],
            [
                Constants::ENG_NAME => "Cabbage looper",
                Constants::NAME => "گوبھی کا لوپر",
                Constants::IMAGE => "https://plantvillage-production-new.s3.amazonaws.com/images/pics/000/001/354/original/Cabbage_looper.JPG?1378393427",
                Constants::CAUSE => "پتیوں میں بڑے یا چھوٹے سوراخ؛ نقصان اکثر وسیع؛ کیٹرپلر ہلکے سبز ہوتے ہیں جن کے جسم کے دونوں طرف سفید لکیریں چلتی ہیں۔ کیٹرپلر آسانی سے اس طرح پہچانے جاتے ہیں جس طرح وہ حرکت کرتے وقت اپنے جسم کو آرک کرتے ہیں۔ انڈے اکیلے ڈالے جاتے ہیں، عام طور پر پتی کی نچلی سطح پر پتے کے مارجن کے قریب، اور سفید یا ہلکے سبز رنگ کے ہوتے ہیں۔",
                Constants::SOLUTION => "لوپر کی آبادی کو عام طور پر قدرتی دشمنوں کے ذریعے روکا جاتا ہے۔ اگر وہ پریشانی کا باعث بن جاتے ہیں تو پودوں سے لاروا ہاتھ سے اٹھایا جا سکتا ہے۔ ایک باضابطہ طور پر قابل قبول کنٹرول طریقہ Bacillus thuringiensis کا اطلاق ہے جو کم عمر لاروا کو مؤثر طریقے سے مار دیتا ہے۔ کیمیائی سپرے قدرتی دشمنوں کی آبادی کو نقصان پہنچا سکتے ہیں اور ان کا انتخاب احتیاط سے کیا جانا چاہیے۔",
            ],
            [
                Constants::ENG_NAME => "Flea beetle",
                Constants::NAME => "فلی بیٹل",
                Constants::IMAGE => "https://plantvillage-production-new.s3.amazonaws.com/images/pics/000/000/817/original/Flea_beetle_2.jpg?1370960500",
                Constants::CAUSE => "پتوں میں چھوٹے سوراخ یا گڑھے جو پودوں کو ایک خصوصیت شاتھو کی شکل دیتے ہیں۔ نوجوان پودے اور seedlings خاص طور پر حساس ہیں؛ پودوں کی نشوونما کم ہوسکتی ہے۔ اگر نقصان شدید ہو تو پودا مارا جا سکتا ہے۔ نقصان کا ذمہ دار ایک چھوٹا (1.5–3.0 ملی میٹر) گہرا رنگ کا چقندر ہے جو پریشان ہونے پر چھلانگ لگا دیتا ہے۔ برنگ اکثر ظاہری شکل میں چمکدار ہوتے ہیں",
                Constants::SOLUTION => "ایسے علاقوں میں جہاں پسو برنگ کا مسئلہ ہے، چقندر کے ابھرنے سے پہلے تیرتے ہوئے قطاروں کو استعمال کرنا پڑتا ہے تاکہ جوان پودوں کی حفاظت کے لیے جسمانی رکاوٹ فراہم کی جا سکے۔ چقندر ایک مسئلہ بننے سے پہلے قیام کی اجازت دینے کے لیے بیج کو جلد لگائیں - بالغ پودے نقصان کے لیے کم حساس ہوتے ہیں۔ ٹریپ فصلیں کنٹرول کا ایک پیمانہ فراہم کرسکتی ہیں - مصلوب پودے بہترین ہیں۔ ملچ کی موٹی تہہ لگانے سے چقندر کو سطح تک پہنچنے سے روکنے میں مدد مل سکتی ہے۔ diamotecoeus ارتھ پر استعمال یا تیل جیسے نیم کا تیل نامیاتی کاشتکاروں کے لیے موثر کنٹرول کے طریقے ہیں۔ کاربیرل، اسپینوساد، بائیفینتھرین اور پرمیتھرین پر مشتمل کیڑے مار ادویات کا استعمال ایک ہفتے تک چقندر پر مناسب کنٹرول فراہم کرسکتا ہے لیکن اسے دوبارہ لاگو کرنے کی ضرورت ہوگی۔",
            ],
            [
                Constants::ENG_NAME => "Anthracnose",
                Constants::NAME => "اینتھراکنوز",
                Constants::IMAGE => "https://www.ugaoo.com/knowledge-center/wp-content/uploads/2017/07/shutterstock_274663073.jpg",
                Constants::CAUSE => "یہ پھپھوندی کی ایک قسم ہے جو مون سون کے دوران پھیلتی ہے اور بنیادی طور پر سدا بہار اور پتلی پودوں کو متاثر کرتی ہے۔ یہ سب سے پہلے پتوں کے چوڑے اطراف میں عام طور پر گہرے رنگ کے گھاووں کے ساتھ پتوں کی نشوونما سے شروع ہوتا ہے۔ پھر، یہ پودے کے باقی حصوں میں پھیلنا شروع کر دیتا ہے، جس کی وجہ سے یہ مرجھا جاتا ہے اور مرجھا جاتا ہے۔ یہ وقت سے پہلے پتوں اور پھلوں کے گرنے کا سبب بنے گا جو آپ کے پودے کو بنجر چھوڑ سکتا ہے۔",
                Constants::SOLUTION => "اس بیماری سے نمٹنے کے لیے سب سے بہتر یہ ہے کہ مون سون کا موسم شروع ہونے سے پہلے پودوں سے متاثرہ اعضاء کو ہٹا دیا جائے۔ اس کے علاوہ، آپ فنگسائڈل سپرے استعمال کرسکتے ہیں جو بعض اوقات کارآمد ثابت ہوئے ہیں۔",
            ],
            [
                Constants::ENG_NAME => "Fire blight",
                Constants::NAME => "آگ کی خرابی",
                Constants::IMAGE => "https://www.ugaoo.com/knowledge-center/wp-content/uploads/2017/07/shutterstock_149432456.jpg",
                Constants::CAUSE => "بلائیٹ کا ایک ورژن جو عام طور پر ان درختوں کو متاثر کرتا ہے جو نسبتاً بڑے پھل جیسے ناشپاتی اور سیب پیدا کرتے ہیں۔ علامات تقریباً کسی بھی دوسرے بلائیٹ بیماری کی طرح ہی ہوتی ہیں، جن کی خصوصیت قبل از وقت پھل گرنا ہے۔",
                Constants::SOLUTION => "بدقسمتی سے، آگ کے جھلسنے کا کوئی علاج نہیں ہے، اس لیے آگ سے جھلسنے کا بہترین علاج باقاعدگی سے کٹائی اور کسی بھی متاثرہ تنوں یا شاخوں کو ہٹانا ہے۔ اس سے اوور ہیڈ آبپاشی سے بچنے میں بھی مدد مل سکتی ہے، کیونکہ پانی کا چھڑکاؤ انفیکشن پھیلانے کے سب سے عام طریقوں میں سے ایک ہے۔",
            ],
            [
                Constants::ENG_NAME => "Gummy Stem Blight",
                Constants::NAME => "چپچپا اسٹیم بلائٹ",
                Constants::IMAGE => "https://171dxwjpaqv2danpq11ixf2j-wpengine.netdna-ssl.com/wp-content/uploads/2020/01/leaf-spots-caused-by-gummy-stem-blight-on-watermel-1-331x221.jpeg",
                Constants::CAUSE => "علامات میں مختلف سائز کے بھورے یا ٹین دھبوں کے ساتھ پتے شامل ہیں جو آخر کار پورے پتے کو ڈھانپ سکتے ہیں۔ تنے پھٹ کر کھلے زخم بن سکتے ہیں جسے کینکر کہتے ہیں۔ ان کھلے زخموں کی سطح پر بھورا، چپچپا مادہ ظاہر ہو سکتا ہے۔ متاثرہ بیلیں عام طور پر موسم کے وسط کے بعد مرجھا جاتی ہیں۔ متاثرہ تنے یکے بعد دیگرے مر جاتے ہیں، اور پودے اور پوری انفرادی انگوریں ہلاک ہو سکتی ہیں۔ متاثرہ پھلوں پر فاسد گول دھبے ہوتے ہیں، اور ایک گیلی سڑ ہوتی ہے جہاں فنگس رند میں داخل ہوتی ہے۔",
                Constants::SOLUTION => "ایسی کوئی اقسام نہیں ہیں جو اس بیماری کے خلاف مزاحم ہوں۔ یہ بیماری بیجوں سے لگنے والی ہو سکتی ہے، اس لیے کسی معتبر ذریعہ سے بیج خریدیں۔ باغ میں پودوں کے تمام ملبے کو ہٹا دیں اور تلف کریں کیونکہ یہ بیماری پودوں کے ملبے پر سال بہ سال زندہ رہ سکتی ہے۔ اس بیماری کے واقعات کو کم کرنے کے مؤثر طریقے کے طور پر فصلوں کو غیر میزبان پودوں جیسے مکئی کے ساتھ دو یا زیادہ سال تک گھمائیں۔ پانی دیتے وقت پتوں کو گیلا کرنے سے گریز کریں۔ اگر بیماری اتنی شدید ہے کہ کیمیائی کنٹرول کی ضمانت دے سکتا ہے، تو روک تھام کرنے والی فنگسائڈز دستیاب ہیں۔",
            ],
            [
                Constants::ENG_NAME => "Blossom-End Rot",
                Constants::NAME => "Blossom-End Rot",
                Constants::IMAGE => "https://171dxwjpaqv2danpq11ixf2j-wpengine.netdna-ssl.com/wp-content/uploads/2020/01/blossom-end-rot-on-watermelon-clemson-university-331x221.jpeg",
                Constants::CAUSE => "بلاسم اینڈ سڑ ایک گہرے رنگ کے خشک سڑ کے طور پر پھل کے سرے پر ظاہر ہوتا ہے جہاں پھول تھا۔ یہ مسئلہ ترقی پذیر پھلوں میں کیلشیم کی کمی کی وجہ سے ہوتا ہے۔ یہ اس بات کا اشارہ ہے کہ مٹی میں کیلشیم کی کمی ہے یا پودے میں کافی کیلشیم لینے کی صلاحیت نہیں ہے۔ جب نشوونما تیز ہوتی ہے تو ترقی پذیر پھل کے کھلنے والے سرے تک کافی کیلشیم نہیں پہنچ سکتا۔",
                Constants::SOLUTION => "پودے لگانے سے پہلے اپنے مقامی کاؤنٹی ایکسٹینشن آفس کے ذریعے اپنی مٹی کا ٹیسٹ کروا کر اور سفارشات کے مطابق چونا، عام طور پر پی ایچ 6.5 تک لے کر پھولوں کی سڑ کو روکنے میں مدد کریں۔ ہمیشہ نمی کی مناسب فراہمی کو برقرار رکھیں، خاص طور پر پھلوں کی نشوونما کے دوران۔ مٹی اور پانی کے پودوں کو خشک ہونے والے طویل عرصے کے دوران تیزی سے خشک ہونے سے روکنے کے لیے ملچ پلانٹس۔ کیلشیم کی کمی والی زمین پر چونے لگانے کے لیے 1 سے 2 پاؤنڈ جپسم فی 100 مربع فٹ لگائیں۔ پودے لگانے سے پہلے چونا اور/یا جپسم لگانا چاہیے۔",
            ],
            [
                Constants::ENG_NAME => "Marssonina leaf spot",
                Constants::NAME => "مارسونینا پتی کی جگہ",
                Constants::IMAGE => "https://extension.umn.edu/sites/extension.umn.edu/files/styles/crop_featured_image_crop/public/marssonia-leaf-spot-on-euonymus-grabowski.jpg?h=d7856bc0&itok=6Xt6_yG_",
                Constants::CAUSE => "یہاں پتے کی جگہ کی بہت سی بیماریاں ہیں جو کہ مقامی اور سجاوٹی درختوں اور جھاڑیوں کی ایک وسیع رینج پر ہوتی ہیں۔ بہت سے لیف اسپاٹ بیماریوں میں حیاتیات ایک جیسی ہوتی ہیں اور اسی وجہ سے انتظام کے اختیارات بہت ملتے ہیں۔

ان میں سے کچھ بیماریوں کے بارے میں معلومات ذیل میں شامل کی گئی ہیں اور انتظامی معلومات کے ساتھ سایہ دار درختوں اور جھاڑیوں کی تمام پتوں کی جگہوں کی بیماریوں پر لاگو ہوتا ہے۔",
                Constants::SOLUTION => "پتوں کے داغ کی بیماریاں فوٹو سنتھیسز میں خلل ڈال کر درختوں اور جھاڑیوں کو کمزور کر دیتی ہیں۔
زیادہ تر پتوں کے دھبوں کی بیماریاں درخت کے پتوں کے مجموعی حصے کے صرف ایک چھوٹے سے حصے کو متاثر کرتی ہیں، اور یہ درخت کی صحت پر ایک معمولی دباؤ ہیں۔
پتوں کے دھبوں کی بیماریوں کو سنجیدگی سے لینا چاہیے اگر ان کے نتیجے میں دو سے چار سال لگاتار پتوں کا اعتدال سے مکمل نقصان ہوتا ہے۔
مسلسل بڑھتے ہوئے کئی موسموں کے دوران پتوں کے جھڑنے کے نتیجے میں نشوونما میں کمی اور کیڑوں اور دیگر بیماریوں کے لیے حساسیت میں اضافہ ہو سکتا ہے۔",
            ],
            [
                Constants::ENG_NAME => "Bacterial Spot",
                Constants::NAME => "بیکٹیریل سپاٹ",
                Constants::IMAGE => "https://171dxwjpaqv2danpq11ixf2j-wpengine.netdna-ssl.com/wp-content/uploads/2020/12/bacterial-spot-xanthomonas-perforans-symptoms-ca-331x248.jpeg",
                Constants::CAUSE => "یہ بیماری بیکٹیریم Xanthomonas کی کئی انواع (لیکن بنیادی طور پر Xanthomonas perforans) کی وجہ سے ہوتی ہے، جو سبز لیکن سرخ ٹماٹروں کو متاثر کرتے ہیں۔ مرچیں بھی متاثر ہوتی ہیں۔ یہ بیماری گیلے موسم میں زیادہ پھیلتی ہے۔ پودوں کو پہنچنے والے نقصان میں پتوں اور پھلوں کے دھبے شامل ہوتے ہیں، جس کے نتیجے میں پیداوار میں کمی، پھوٹ پڑنے، اور دھوپ سے پھولنے والے پھل ہوتے ہیں۔ علامات میں پتوں پر بہت سے چھوٹے، کونیی سے بے قاعدہ، پانی میں بھیگے ہوئے دھبوں اور پھلوں پر ہلکے کھردرے دھبوں پر مشتمل ہوتا ہے۔ پتوں کے دھبوں پر پیلے رنگ کا ہالہ ہو سکتا ہے۔ مراکز خشک ہو جاتے ہیں اور اکثر پھٹ جاتے ہیں۔",
                Constants::SOLUTION => "صرف تصدیق شدہ بیماری سے پاک بیج اور پودے استعمال کریں۔ ان علاقوں سے پرہیز کریں جہاں پچھلے سال کالی مرچ یا ٹماٹر لگائے گئے تھے۔ ڈرپ یا فیرو ایریگیشن کا استعمال کرکے اوور ہیڈ پانی دینے سے گریز کریں۔ تمام بیمار پودوں کے مواد کو ہٹا دیں اور ٹھکانے لگائیں۔ ہوا کی گردش کو فروغ دینے کے لیے پودوں کی کٹائی کریں۔ تانبے کی فنگسائڈ کے ساتھ چھڑکنے سے بیکٹیریل بیماری پر کافی حد تک قابو پائے گا۔ لیبل پر دی گئی ہدایات پر عمل کریں۔ گھریلو باغ کے استعمال کے لیے فنگسائڈ مصنوعات کے لیے جدول 1 دیکھیں۔",
            ],
        ]);
    }
}
